README.md
```mermaid
graph TD
    user((Usuario<br>Navegador))
    
    subgraph Cloud [Nube Externa]
        entraId[Microsoft Entra ID<br>Identity Provider]
        acr[(Azure Container Registry<br>pedidos360acr7457)]
    end
    
    subgraph RG [Azure Resource Group: pedidos360-rg-br]
        frontend[Frontend Service<br>Angular + Nginx<br>Container App]
        apim{{API Management<br>pedidos360-apim-1128}}
        
        subgraph Env [Entorno Container Apps: pedidos360-env]
            bff[BFF Service<br>Spring Boot]
            productos[Productos Service<br>Spring Boot]
            pedidos[Pedidos Service<br>Spring Boot]
        end
    end

    user -->|Accede a la URL| frontend
    user -.->|Login Interactivo MSAL| entraId
    frontend -.->|Valida token / Redirect URI| entraId

    frontend ==>|Peticiones a la API<br>Adjunta JWT| apim
    apim -.->|Verifica llaves públicas<br>para validar JWT| entraId
    apim ==>|Redirige tráfico<br>si el JWT es válido| bff

    bff ==>|Llama servicio interno| productos
    bff ==>|Llama servicio interno| pedidos

    acr -.->|Pull imagen Docker| frontend
    acr -.->|Pull imagen Docker| bff
    acr -.->|Pull imagen Docker| productos
    acr -.->|Pull imagen Docker| pedidos
```
